kerikun11/esp32-matter-turntable/firmware/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# libsodium

# NIMBLE
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_TRANSPORT_EVT_SIZE=70
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y

# FreeRTOS should use legacy API
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# Use ESP-IDF mDNS so application host aliases share Matter's responder.
# CONFIG_USE_MINIMAL_MDNS is not set
CONFIG_ENABLE_EXTENDED_DISCOVERY=y
